Repository: lucasangoston/IOS-Project
Catalog: SwiftProject/*.lproj/Localizable.strings
Languages: fr

# login.title
source: Login
fr: Connexion

# login.form.email.placeholder
source: Email
fr: Mail

# login.form.password.placeholder
source: Password
fr: Mot de passe

# login.form.login.button
source: Login
fr: Connexion

# login.register.button
source: Doesn't have an account ?
fr: Vous n'avez pas de compte ?

# login.alert.message
source: Identifiants Incorrects
fr: Veuillez essayez de nouveau

# login.form.alert.title
source: Invalid form
fr: Forme non valide

# login.form.alert.close
source: Close
fr: Fermer

# login.form.alert.invalid
source: All fields are required
fr: Tous les champs sont requis

# login.form.alert.invalid.email
source: The login must contains at least 4 characters
fr: Le login doit contenir au moins 4 caractères

# login.form.alert.invalid.password
source: The password must contains at least 6 characters
fr: Le mot de passe doit contenir au moins 6 caractères

# register.title
source: Register
fr: Inscription

# register.form.name.placeholder
source: Name
fr: Nom

# register.form.email.placeholder
source: Email
fr: Mail

# register.form.password.placeholder
source: Password
fr: Mot de passe

# register.button
source: Register
fr: Inscription

# register.button.login
source: Already an account ?
fr: Déjà un compte ?

# register.alert.title
source: Successful registration !
fr: Inscription Réussie !

# register.alert.message
source: All you have to do is log in.
fr: Vous n'avez plus qu'à vous connecter.

# register.alert.email
source: Wrong email format
fr: Mauvais format Email

# register.alert.email.message
source: Your email does not have the correct format. (example@test.com).
fr: Votre email n'a pas le bon format souhaité. (exemple@test.com).

# register.alert.password
source: Your password is too short
fr: Votre mot de passe est trop court

# register.alert.password.message
source: Your password needs at least 8 characters.
fr: Votre mot de passe à besoin d'au moins 8 caractères.

# register.alert.email.exist
source: This email already exists
fr: Ce mail existe déjà

# register.alert.email.exist.message
source: Try logging in instead.
fr: Essayez de vous connectez plutôt.

# search.title
source: Search
fr: Rechercher

# chanelDetail.join
source: Join
fr: Rejoindre

# chanelDetail.joined
source: Joined
fr: Rejoin(t)

# chanelDetail.hi
source: Hey...
fr: Heu..

# chanelDetail.nocontent
source: You have no content to share
fr: Vous n'avez pas de contenu à partager

# chanelDetail.tell
source: Tell what goes through your head!
fr: Raconter ce qui vous passe par la tête !

# chanelDetail.joinFirst
source: You must first join the server if you want to share with the community.
fr: Tu dois d'abord rejoindre le serveur si tu souhaite partager avec la communauté.

# chanelView.s
source: Deleting...
fr: Suppression en cours...

# chanelView.message
source: Are you sure you want to delete the server ?
fr: Voulez-vous vraiment supprimer le serveur ?

# chanelView.message2
source: The server has been successfully deleted.
fr: Le serveur à bien été supprimé.

# chanelView.message3
source: You are trying to delete a server that you did not create...Try deleting your own instead.
fr: vous essayez de supprimer un serveur que vous n'avez pas créer... Essayez plutôt de supprimer les vôtres.

# Non
source: No
fr: Non

# Oui
source: Yes
fr: Oui

# profileViewController.alert.title
source: Log out
fr: Déconnection

# profileViewController.alert.message
source: Do you want to be logged out?
fr: Voulez-vous être déconnecté ?

# createChanel.title
source: Congratulation !
fr: Félicitations !

# createChanel.message
source: Your chanel has been created
fr: Votre chanel à bien été créé
